<a href="https://colab.research.google.com/github/karmagurung00/Data_Analytics/blob/main/Track1/Python/Data_Wrangling_Classwork.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df=pd.read_csv('https://raw.githubusercontent.com/CunyLaguardiaDataAnalytics/datasets/master/BL-Flickr-Images-Book.csv')

In [ ]:
df.shape

(8287, 15)

In [ ]:
df.describe()

         Identifier  Corporate Author  Corporate Contributors  Engraver
count  8.287000e+03               0.0                     0.0       0.0
mean   2.017344e+06               NaN                     NaN       NaN
std    1.190379e+06               NaN                     NaN       NaN
min    2.060000e+02               NaN                     NaN       NaN
25%    9.157875e+05               NaN                     NaN       NaN
50%    2.043707e+06               NaN                     NaN       NaN
75%    3.047430e+06               NaN                     NaN       NaN
max    4.160339e+06               NaN                     NaN       NaN

In [ ]:
df.head(10)

   Identifier  ...                              Shelfmarks
0         206  ...       British Library HMNTS 12641.b.30.
1         216  ...       British Library HMNTS 12626.cc.2.
2         218  ...       British Library HMNTS 12625.dd.1.
3         472  ...     British Library HMNTS 10369.bbb.15.
4         480  ...        British Library HMNTS 9007.d.28.
5         481  ...       British Library HMNTS 9006.ee.10.
6         519  ...        British Library HMNTS 12637.e.3.
7         667  ...      British Library HMNTS 011652.g.73.
8         874  ...      British Library HMNTS 11645.bb.42.
9        1143  ...  British Library HMNTS 11602.ee.10.(2.)

[10 rows x 15 columns]

In [ ]:
df.tail()

      Identifier  ...                                         Shelfmarks
8282     4158088  ...  British Library HMNTS|British Library HMNTS 10...
8283     4158128  ...  British Library HMNTS|British Library HMNTS 10...
8284     4159563  ...  British Library HMNTS|British Library HMNTS 19...
8285     4159587  ...  British Library HMNTS|British Library HMNTS 10...
8286     4160339  ...  British Library HMNTS|British Library HMNTS 79...

[5 rows x 15 columns]

In [ ]:
columns_to_be_dropped=['Edition Statement','Corporate Author','Corporate Contributors','Former owner','Engraver']
type(columns_to_be_dropped)

list

In [ ]:
new_book_df=df.drop(columns_to_be_dropped,axis=1)
new_book_df.head()

   Identifier  ...                           Shelfmarks
0         206  ...    British Library HMNTS 12641.b.30.
1         216  ...    British Library HMNTS 12626.cc.2.
2         218  ...    British Library HMNTS 12625.dd.1.
3         472  ...  British Library HMNTS 10369.bbb.15.
4         480  ...     British Library HMNTS 9007.d.28.

[5 rows x 10 columns]

In [ ]:
new_book_df['Identifier'].is_unique

True

In [ ]:
book_reindexed_df=new_book_df.set_index('Identifier')
book_reindexed_df.head()

                Place of Publication  ...                           Shelfmarks
Identifier                            ...
206                           London  ...    British Library HMNTS 12641.b.30.
216         London; Virtue & Yorston  ...    British Library HMNTS 12626.cc.2.
218                           London  ...    British Library HMNTS 12625.dd.1.
472                           London  ...  British Library HMNTS 10369.bbb.15.
480                           London  ...     British Library HMNTS 9007.d.28.

[5 rows x 9 columns]

In [ ]:
type(book_reindexed_df)

pandas.core.frame.DataFrame

In [ ]:
new_book_df['Date of Publication'].value_counts()

1897          157
1896          150
1893          130
1892          127
1898          125
             ...
1707            1
[1861-63.]      1
1860/3-79       1
1866-           1
1827-38         1
Name: Date of Publication, Length: 1148, dtype: int64

In [ ]:
new_book_df['Place of Publication'].value_counts()

London                                   3868
Paris                                     479
Edinburgh                                 208
New York                                  177
Leipzig                                   119
                                         ...
Pesth, Darmstadt [printed]                  1
Elliot Stock                                1
pp. 15. J. W. Southgate: London, 1839       1
Soissons                                    1
Eastbourne                                  1
Name: Place of Publication, Length: 1441, dtype: int64

In [ ]:
new_book_df['Publisher'].value_counts()

Macmillan & Co.                              85
London                                       69
Privately printed                            53
Longmans & Co.                               52
Hurst & Blackett                             51
                                             ..
T. N. Longman & O. Rees; Richard Phillips     1
Simpkin & Co.                                 1
Oliver Ratcliff                               1
Sampson Low                                   1
G. B. Whittaker                               1
Name: Publisher, Length: 1989, dtype: int64

In [ ]:
new_book_df['Author'].value_counts()

Shakespeare, William                  48
Byron, George Gordon Byron - Baron    40
Scott, Walter - Sir                   29
Burns, Robert                         28
NORIE, John William.                  26
                                      ..
TSCHUDI, Johann Jakob von.             1
BRODIE, George Staunton.               1
HOLLINGSWORTH, Alfred Johnstone.       1
G., K.                                 1
NOURSE, Joseph Everett.                1
Name: Author, Length: 5005, dtype: int64

In [ ]:
book_reindexed_df['Date of Publication'].str.isnumeric()

Identifier
206        False
216         True
218         True
472         True
480         True
           ...
4158088     True
4158128    False
4159563    False
4159587     True
4160339    False
Name: Date of Publication, Length: 8287, dtype: object

In [ ]:
book_reindexed_df.loc[206]

Place of Publication                                               London
Date of Publication                                           1879 [1878]
Publisher                                                S. Tinsley & Co.
Title                                   Walter Forbes. [A novel.] By A. A
Author                                                              A. A.
Contributors                                              FORBES, Walter.
Issuance type                                                 monographic
Flickr URL              http://www.flickr.com/photos/britishlibrary/ta...
Shelfmarks                              British Library HMNTS 12641.b.30.
Name: 206, dtype: object

In [ ]:
book_reindexed_df.loc[4158128]

Place of Publication                                                Derby
Date of Publication                                              1831, 32
Publisher                                                 M. Mozley & Son
Title                   The History and Gazetteer of the County of Der...
Author                                         GLOVER, Stephen - of Derby
Contributors                                               NOBLE, Thomas.
Issuance type                                                 monographic
Flickr URL              http://www.flickr.com/photos/britishlibrary/ta...
Shelfmarks              British Library HMNTS|British Library HMNTS 10...
Name: 4158128, dtype: object

In [ ]:
regex_val=r'^(\d{4})'
book_reindexed_df['Date of Publication']= book_reindexed_df['Date of Publication'].str.extract(regex_val, expand=False)
book_reindexed_df['Date of Publication']

Identifier
206        1879
216        1868
218        1869
472        1851
480        1857
           ...
4158088    1838
4158128    1831
4159563     NaN
4159587    1834
4160339    1834
Name: Date of Publication, Length: 8287, dtype: object

In [ ]:
book_reindexed_df['Date of Publication'].str.isnumeric()

Identifier
206        True
216        True
218        True
472        True
480        True
           ...
4158088    True
4158128    True
4159563     NaN
4159587    True
4160339    True
Name: Date of Publication, Length: 8287, dtype: object

In [ ]:
book_reindexed_df['Date of Publication']

Identifier
206        1879
216        1868
218        1869
472        1851
480        1857
           ...
4158088    1838
4158128    1831
4159563     NaN
4159587    1834
4160339    1834
Name: Date of Publication, Length: 8287, dtype: object

In [ ]:
property_df=pd.read_csv('https://raw.githubusercontent.com/CunyLaguardiaDataAnalytics/datasets/master/property.csv')

In [ ]:
property_df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [ ]:
property_df.shape

(9, 7)

In [ ]:
property_df.head()

           PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            Y            3        1  1000
1  100002000.0   197.0  LEXINGTON            N            3      1.5    --
2  100003000.0     NaN  LEXINGTON            N          NaN        1   850
3  100004000.0   201.0   BERKELEY           12            1      NaN   700
4          NaN   203.0   BERKELEY            Y            3        2  1600

In [ ]:
property_df['ST_NUM']

0    104.0
1    197.0
2      NaN
3    201.0
4    203.0
5    207.0
6      NaN
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

In [ ]:
property_df['ST_NUM'].isnull().count()

9

In [ ]:
property_df["ST_NUM"].isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

In [ ]:
property_df['NUM_BATH']=pd.to_numeric(property_df['NUM_BATH'],errors='coerce')
property_df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3       1.0  1000
1  100002000.0   197.0   LEXINGTON            N            3       1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN       1.0   850
3  100004000.0   201.0    BERKELEY           12            1       NaN   700
4          NaN   203.0    BERKELEY            Y            3       2.0  1600
5  100006000.0   207.0    BERKELEY            Y          NaN       1.0   800
6  100007000.0     NaN  WASHINGTON          NaN            2       NaN   950
7  100008000.0   213.0     TREMONT            Y            1       1.0   NaN
8  100009000.0   215.0     TREMONT            Y           na       2.0  1800

In [ ]:
new_prop_df=property_df.dropna()
new_prop_df

           PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            Y            3       1.0  1000
1  100002000.0   197.0  LEXINGTON            N            3       1.5    --
8  100009000.0   215.0    TREMONT            Y           na       2.0  1800

In [ ]:
missing_values=['-','--','na','n/a','NA']

In [ ]:
property_na_fix_df=pd.read_csv('https://raw.githubusercontent.com/CunyLaguardiaDataAnalytics/datasets/master/property.csv',na_values= missing_values)

In [ ]:
property_na_fix_df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:
property_na_fix_df.NUM_BEDROOMS.unique

<bound method Series.unique of 0    3.0
1    3.0
2    NaN
3    1.0
4    3.0
5    NaN
6    2.0
7    1.0
8    NaN
Name: NUM_BEDROOMS, dtype: float64>

In [ ]:
property_na_fix_df['NUM_BATH']=pd.to_numeric(property_na_fix_df['NUM_BATH'],errors='coerce')
property_na_fix_df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0       1.0  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0       1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN       1.0   850.0
3  100004000.0   201.0    BERKELEY           12           1.0       NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0       2.0  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN       1.0   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0       NaN   950.0
7  100008000.0   213.0     TREMONT            Y           1.0       1.0     NaN
8  100009000.0   215.0     TREMONT            Y           NaN       2.0  1800.0

In [ ]:
property_na_fix_df['PROP_TYPE']=np.where((property_na_fix_df['SQ_FT']>1000),'BIG','SMALL')
property_na_fix_df

           PID  ST_NUM     ST_NAME  ... NUM_BATH   SQ_FT  PROP_TYPE
0  100001000.0   104.0      PUTNAM  ...      1.0  1000.0      SMALL
1  100002000.0   197.0   LEXINGTON  ...      1.5     NaN      SMALL
2  100003000.0     NaN   LEXINGTON  ...      1.0   850.0      SMALL
3  100004000.0   201.0    BERKELEY  ...      NaN   700.0      SMALL
4          NaN   203.0    BERKELEY  ...      2.0  1600.0        BIG
5  100006000.0   207.0    BERKELEY  ...      1.0   800.0      SMALL
6  100007000.0     NaN  WASHINGTON  ...      NaN   950.0      SMALL
7  100008000.0   213.0     TREMONT  ...      1.0     NaN      SMALL
8  100009000.0   215.0     TREMONT  ...      2.0  1800.0        BIG

[9 rows x 8 columns]

In [ ]:
property_na_fix_df['SQ_FT'].isna()

0    False
1     True
2    False
3    False
4    False
5    False
6    False
7     True
8    False
Name: SQ_FT, dtype: bool

In [ ]:
property_na_fix_df['PROP_TYPE']=np.where((property_na_fix_df['SQ_FT'].isna()== False),property_na_fix_df['SQ_FT'],'Unknown')
property_na_fix_df

           PID  ST_NUM     ST_NAME  ... NUM_BATH   SQ_FT  PROP_TYPE
0  100001000.0   104.0      PUTNAM  ...      1.0  1000.0     1000.0
1  100002000.0   197.0   LEXINGTON  ...      1.5     NaN    Unknown
2  100003000.0     NaN   LEXINGTON  ...      1.0   850.0      850.0
3  100004000.0   201.0    BERKELEY  ...      NaN   700.0      700.0
4          NaN   203.0    BERKELEY  ...      2.0  1600.0     1600.0
5  100006000.0   207.0    BERKELEY  ...      1.0   800.0      800.0
6  100007000.0     NaN  WASHINGTON  ...      NaN   950.0      950.0
7  100008000.0   213.0     TREMONT  ...      1.0     NaN    Unknown
8  100009000.0   215.0     TREMONT  ...      2.0  1800.0     1800.0

[9 rows x 8 columns]

In [ ]:
new_prop_df_BR=property_df['NUM_BEDROOMS'].fillna(0,inplace=False)
new_prop_df_BR

0     3
1     3
2     0
3     1
4     3
5     0
6     2
7     1
8    na
Name: NUM_BEDROOMS, dtype: object